# Pandas
### 01-09-2022

In [11]:
import numpy as np
import pandas as pd

How to handle missing values.

In [12]:
data = pd.Series([2, 3, 2, 4, None, 6, 8, 9, np.nan])
data

0    2.0
1    3.0
2    2.0
3    4.0
4    NaN
5    6.0
6    8.0
7    9.0
8    NaN
dtype: float64

In [13]:
data.isna()
data.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8     True
dtype: bool

In [14]:
data.notna()
data.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [15]:
data[data.notna()]

0    2.0
1    3.0
2    2.0
3    4.0
5    6.0
6    8.0
7    9.0
dtype: float64

In [16]:
data.describe()

count    7.000000
mean     4.857143
std      2.853569
min      2.000000
25%      2.500000
50%      4.000000
75%      7.000000
max      9.000000
dtype: float64

How to fill the missing values.

In [17]:
data.fillna(data.mean()) # , inplace=True

0    2.000000
1    3.000000
2    2.000000
3    4.000000
4    4.857143
5    6.000000
6    8.000000
7    9.000000
8    4.857143
dtype: float64

In [18]:
data.fillna(method='ffill')
data.fillna(method='bfill')

0    2.0
1    3.0
2    2.0
3    4.0
4    6.0
5    6.0
6    8.0
7    9.0
8    NaN
dtype: float64

How to drop missing values.

In [19]:
data.dropna()

0    2.0
1    3.0
2    2.0
3    4.0
5    6.0
6    8.0
7    9.0
dtype: float64

In [20]:
df = pd.DataFrame([[2, 3, 4, 5], [5 ,np.nan, 6, 7], [6, None, 8, np.nan]], columns=list('PQRS'))
df

   P    Q  R    S
0  2  3.0  4  5.0
1  5  NaN  6  7.0
2  6  NaN  8  NaN

In [21]:
df.describe()

              P    Q    R         S
count  3.000000  1.0  3.0  2.000000
mean   4.333333  3.0  6.0  6.000000
std    2.081666  NaN  2.0  1.414214
min    2.000000  3.0  4.0  5.000000
25%    3.500000  3.0  5.0  5.500000
50%    5.000000  3.0  6.0  6.000000
75%    5.500000  3.0  7.0  6.500000
max    6.000000  3.0  8.0  7.000000

In [22]:
df.notna()

      P      Q     R      S
0  True   True  True   True
1  True  False  True   True
2  True  False  True  False

In [23]:
df.isna().any()

P    False
Q     True
R    False
S     True
dtype: bool

In [24]:
df.fillna(0)

   P    Q  R    S
0  2  3.0  4  5.0
1  5  0.0  6  7.0
2  6  0.0  8  0.0

In [25]:
df.fillna(df.mean())

   P    Q  R    S
0  2  3.0  4  5.0
1  5  3.0  6  7.0
2  6  3.0  8  6.0

In [26]:
df.fillna(df.stack().mean()) # sum of all values / total - missing

   P         Q  R         S
0  2  3.000000  4  5.000000
1  5  5.111111  6  7.000000
2  6  5.111111  8  5.111111

In [27]:
df.fillna(df.mean().mean()) # sum of all values / total

   P         Q  R         S
0  2  3.000000  4  5.000000
1  5  4.833333  6  7.000000
2  6  4.833333  8  4.833333

In [28]:
df

   P    Q  R    S
0  2  3.0  4  5.0
1  5  NaN  6  7.0
2  6  NaN  8  NaN

In [29]:
df.fillna(method='ffill') # default axis=0
df.fillna(method='ffill', axis=1)

     P    Q    R    S
0  2.0  3.0  4.0  5.0
1  5.0  5.0  6.0  7.0
2  6.0  6.0  8.0  8.0

In [30]:
df.dropna()

   P    Q  R    S
0  2  3.0  4  5.0

In [31]:
df.dropna(axis=1)

   P  R
0  2  4
1  5  6
2  6  8

In [32]:
df.dropna(how='all')

   P    Q  R    S
0  2  3.0  4  5.0
1  5  NaN  6  7.0
2  6  NaN  8  NaN

In [38]:
df.dropna(thresh=2)

   P    Q  R    S
0  2  3.0  4  5.0
1  5  NaN  6  7.0
2  6  NaN  8  NaN

Concat operation

In [47]:
df1 = pd.DataFrame(np.random.randint(0, 10, (4, 4)), columns=list('PQRS'))
df1

   P  Q  R  S
0  2  7  0  7
1  1  3  8  6
2  6  4  3  1
3  8  3  6  0

In [55]:
df2 = pd.DataFrame(np.random.randint(0, 10, (3, 4)), columns=list('PQMN'))
df2

   P  Q  M  N
0  6  6  9  4
1  1  7  6  1
2  2  3  2  3

In [56]:
pd.concat([df1, df2], axis=1)

   P  Q  R  S    P    Q    M    N
0  2  7  0  7  6.0  6.0  9.0  4.0
1  1  3  8  6  1.0  7.0  6.0  1.0
2  6  4  3  1  2.0  3.0  2.0  3.0
3  8  3  6  0  NaN  NaN  NaN  NaN

In [57]:
pd.concat([df1, df2], axis=1, join='outer')

   P  Q  R  S    P    Q    M    N
0  2  7  0  7  6.0  6.0  9.0  4.0
1  1  3  8  6  1.0  7.0  6.0  1.0
2  6  4  3  1  2.0  3.0  2.0  3.0
3  8  3  6  0  NaN  NaN  NaN  NaN

In [59]:
pd.concat([df1, df2], ignore_index=True, axis=1, join='inner')

   0  1  2  3  4  5  6  7
0  2  7  0  7  6  6  9  4
1  1  3  8  6  1  7  6  1
2  6  4  3  1  2  3  2  3

Merge Operation.

In [60]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 'group':['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [62]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue', 'Raj'], 'hire_date':[2004, 2008, 2012, 2018, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2018
4      Raj       2014

on : multiple common columns [on='name']

left_on: simillar column but different name [left_on='name']  
right_on: [left_on='student_name']

how: inner / outer / left / right

In [64]:
pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2018

In [69]:
df3 = pd.merge(df1, df2, how='outer')
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2018
4      Raj          NaN       2014

In [70]:
df4 = pd.DataFrame({'group' : ['Accounting', 'Engineering', 'HR'], 'supervisor': ['Carly', 'Gudi', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering       Gudi
2           HR      Steve

In [76]:
df5 = pd.merge(df3 ,df4)
df5

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012       Gudi
2     Lisa  Engineering       2004       Gudi
3      Sue           HR       2018      Steve

In [82]:
df6 = pd.DataFrame({'group':['Accounting', 'Engineering', 'HR'], 
                    'skills': [['maths', 'spreadsheets'], ['coding', 'linux'], ['spreadsheets', 'organization']]})
df6

         group                        skills
0   Accounting         [maths, spreadsheets]
1  Engineering               [coding, linux]
2           HR  [spreadsheets, organization]

In [83]:
pd.merge(df5, df6)

  employee        group  hire_date supervisor                        skills
0      Bob   Accounting       2008      Carly         [maths, spreadsheets]
1     Jake  Engineering       2012       Gudi               [coding, linux]
2     Lisa  Engineering       2004       Gudi               [coding, linux]
3      Sue           HR       2018      Steve  [spreadsheets, organization]